# GetInLinePartTypes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService..::..GetInLinePartTypes Method
FabricationNetworkChangeService Class See Also
---
Get a set of element identifiers of fabrication part types for in-line parts.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public ISet<ElementId> GetInLinePartTypes()
```

Visual Basic
---
```text
Public Function GetInLinePartTypes As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetInLinePartTypes()
```

# ### Return Value
Returns the set of element identifiers for in-line parts or an empty set if there are none.
# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace